<?php

namespace Database\Seeders;

use App\Models\Service;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class ServiceSeeder extends Seeder
{
    public function run()
    {
        $services = [
            [
                'title' => 'Чоловіча стрижка',
                'description' => 'консультація з вибору стрижки, миття голови ДО (при потребі); миття голови ПІСЛЯ; укладка; рекомендації зі стайлінгу',
            ],
            [
                'title' => 'Стрижка машинкою з переходом',
            ],
            [
                'title' => 'Дитяча стрижка (6-12 років)',
                'description' => 'стрижка дитини ДО 12 років',
            ],
            [
                'title' => 'Стрижка під одну насадку / Корекція стрижки',
                'description' => 'найпростіша стрижка з використанням ОДНІЄЇ насадки миття голови ДО (при потребі); миття голови ПІСЛЯ',
            ],
            [
                'title' => 'Батько та син',
                'description' => 'ЕКОНОМІЯ 50 грн',
            ],
            [
                'title' => 'Чоловіча стрижка + стрижка борода',
                'description' => 'ЕКОНОМІЯ 50 грн',
            ],
            [
                'title' => 'Стрижка бороди',
                'description' => 'консультація з підбору форми бороди; стрижка бороди з розпарюванням гарячим рушником; наведення контурів шаветкою; нанесення засобів після гоління; нанесення одеколону',
            ],
            [
                'title' => 'Контур бороди тримером',
                'description' => 'розпарювання шкіри рушником; нанесення піни; гоління небезпечною бритвою; холодний компрес; нанесення засобів після гоління; нанесення одеколону',
            ],
            [
                'title' => 'Королівське гоління',
                'description' => 'розпарювання шкіри рушником; нанесення піни; гоління небезпечною бритвою; холодний компрес; нанесення засобів після гоління; нанесення одеколону',
            ],
            [
                'title' => 'Укладка',
                'description' => 'консультація з підбору укладки; миття голови ДО (при потребі); рекомендації зі стайлінгу',
            ],
            [
                'title' => 'Камуфлювання сивини',
                'description' => 'тонування (маскування) сивини бороди чи голови (American Crew): підбір тону; нанесення камуфляжу (5-10 хв.); миття голови чи бороди; укладка',
            ],
            [
                'title' => 'Воскова депіляція',
                'description' => 'видалення волосся на обличчі, з носа, з вух воском',
            ],
            [
                'title' => 'Чорна маска',
            ],
        ];

        foreach ($services as $service) {
            Service::create($service);
        }
    }
}
